tap "supabase/tap"
brew "git"
brew "asdf"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "btop"
brew "caddy", restart_service: :changed
brew "chezmoi"
brew "clipboard"
brew "cloc"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "ctop"
brew "duckdb"
brew "eza"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gitleaks"
brew "go"
brew "graphviz"
brew "htop"
brew "httpd"
brew "iftop"
brew "imagemagick"
brew "inframap"
brew "lazygit"
brew "lazysql"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "openjdk@17"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "portaudio"
brew "postgresql@15"
brew "python-tk@3.13"
brew "resvg"
brew "swagger-codegen"
brew "swiftlint"
brew "terminal-notifier"
brew "terraform"
brew "tesseract-lang"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "uv"
brew "yazi"
brew "zoxide"
brew "supabase/tap/supabase"
cask "basictex"
cask "codex"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "kiro"
cask "ngrok"
cask "session-manager-plugin"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
