# Brewfile - Homebrew packages managed by chezmoi
# Usage: brew bundle install --file=Brewfile

# =============================================================================
# Taps
# =============================================================================
tap "supabase/tap"

# =============================================================================
# Development - Core
# =============================================================================
brew "git"                    # Version control
brew "gh"                     # GitHub CLI
brew "lazygit"                # TUI for git
brew "git-delta"              # Better git diff
brew "neovim"                 # Editor
brew "tmux"                   # Terminal multiplexer
brew "universal-ctags"        # Code navigation tags

# =============================================================================
# Development - Tools
# =============================================================================
brew "asdf"                   # Runtime version manager
brew "chezmoi"                # Dotfiles manager
brew "bat"                    # cat with syntax highlighting
brew "yazi"                   # Terminal file manager
brew "tree"                   # Directory tree viewer
brew "cloc"                   # Count lines of code
brew "clipboard"              # Clipboard CLI
brew "coreutils"              # GNU core utilities

# =============================================================================
# Languages & Runtimes
# =============================================================================
brew "go"                     # Go language
brew "node"                   # Node.js
brew "ruby"                   # Ruby
brew "python@3.13"            # Python
brew "python-tk@3.13"         # Python Tkinter
brew "openjdk@17"             # Java 17

# =============================================================================
# Python Tools
# =============================================================================
brew "pipx"                   # Install Python apps in isolation
brew "uv"                     # Fast Python package manager

# =============================================================================
# Cloud & Infrastructure
# =============================================================================
brew "azure-cli"              # Azure CLI
brew "terraform"              # Infrastructure as Code
brew "inframap"               # Terraform visualization
brew "supabase/tap/supabase"  # Supabase CLI

# =============================================================================
# iOS/macOS Development
# =============================================================================
brew "cocoapods"              # iOS dependency manager
brew "swiftlint"              # Swift linter

# =============================================================================
# Data & Database
# =============================================================================
brew "duckdb"                 # Analytical database
brew "postgresql@15"          # PostgreSQL

# =============================================================================
# Media Processing
# =============================================================================
brew "ffmpeg"                 # Video/audio processing
brew "tesseract"              # OCR engine
brew "tesseract-lang"         # OCR language packs
brew "poppler"                # PDF utilities
brew "resvg"                  # SVG renderer
brew "graphviz"               # Graph visualization
brew "ghostscript"            # PostScript/PDF interpreter
brew "pandoc"                 # Document converter

# =============================================================================
# Network & API
# =============================================================================
brew "swagger-codegen"        # API code generator
brew "nghttp2"                # HTTP/2 library
brew "caddy"                  # Web server
brew "httpd"                  # Apache HTTP server
brew "nmap"                   # Network scanner

# =============================================================================
# System Utilities
# =============================================================================
brew "terminal-notifier"      # macOS notifications from CLI
brew "portaudio"              # Audio I/O library

# =============================================================================
# GUI Applications (Casks)
# =============================================================================
cask "basictex"                       # Minimal TeX distribution
cask "codex"                          # OpenAI Codex CLI
cask "gcloud-cli"                     # Google Cloud CLI
cask "kiro"                           # IDE
cask "ngrok"                          # Secure tunnels
cask "session-manager-plugin"         # AWS Session Manager

# =============================================================================
# Fonts
# =============================================================================
cask "font-fira-code-nerd-font"       # Fira Code with icons
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with icons
cask "font-symbols-only-nerd-font"    # Nerd Font symbols only

# =============================================================================
# Go Tools (installed via go install)
# =============================================================================
# Note: These are managed by `go install`, not Homebrew
# go "golang.org/x/tools/gopls"
# go "honnef.co/go/tools/cmd/staticcheck"
